# -------------------------------------------------------------------------
# 데이터 사전처리 => 구간분할 : 수치데이터 => 범주형 데이터
# ------------------------------------------------------------------------
# 모듈 로딩 ---------------------------------------------------------------
import pandas as pd
import numpy as np

# 데이터 준비 --------------------------------------------------------------
# 오른쪽만 포함
# 1~24, 25 ~ 49, 50~74, 75~100
# 0<~<=24, 25<~<=49, 49~<=74, 74<~<=100
data1 = pd.cut(pd.Series(range(101)),
               [0, 24, 49, 74, 100] ,
               include_lowest= False ,
               right=True
              )

print("===include_lowest=False | right=True===")
print(data1.iloc[[0,23,24,25,47,48,49,50,73,74,75,100]])

# # 왼쪽 포함
# # 0~23, 24 ~ 48, 49~73, 74~99
# 0<=~<24, 25<=~<49, 49<=~<74, 74<=~<100
bins=range(0,101,25)
print(f"bins => {list(bins)}" )
data2= pd.cut(pd.Series(range(101)),
       [0, 24, 49, 74, 100] ,
       right= False ,
       include_lowest= True)
print("===include_lowest=True | right=False===")
print(data2.iloc[[0,23,24,25,47,48,49,50,73,74,75,100]])
