# ==========================================================
# 행 & 열 위치 변경 (전치)
# df객체변수명.transpose() 또는 df객체변수명.T
# ==========================================================
import pandas as pd

# 전역변수 ---------------------------------------------------
DEBUG = True  # 개발 중에만 사용

# 데이터 준비 ------------------------------------------------
exam_data = {'수학': [90, 80, 70],
             '영어': [98, 89, 95],
             '음악': [85, 95, 100],
             '체육': [100, 90, 90]}

# 데이터 객체 생성 --------------------------------------------
df = pd.DataFrame(exam_data);

# 인덱스 설정 ------------------------------------------------
df.index = ['학생1', '학생2', '학생3']

if DEBUG:
    # 데이터 객체 정보 출력 - 인덱스, 컬럼, 형태, 데이터
    print(f"df.index => {df.index}")
    print(f"df.columns => {df.columns} ")
    print(f"d => {df.shape}")
    print(f"df => {df}")

# 행 & 열 위치 변경 --------------------------------------------
# (1) 메서드 사용하기
tdf = df.transpose()
print(f"tdf.shape => {tdf.shape}")
print(f"tdf => {tdf}\n")

# (2) 속성 사용하기
tdf = tdf.T
print(f"tdf.shape => {tdf.shape}")
print(f"tdf => {tdf}")
