# --------------------------------------------------------------------
# 데이터 정보 확인
# --------------------------------------------------------------------
# 모듈 로딩 -----------------------------------------------------------
import pandas as pd
import matplotlib.pyplot as plt


# 데이터 준비 ---------------------------------------------------------
# excel => DataFrame 형태
df = pd.read_excel('../data/남북한발전전력량.xlsx')  # 데이터프레임 변환


# 데이터 가공 --------------------------------------------------------
# iloc[행, 열] 남한, 북한 발전량 합계 데이터만 추출
df_ns = df.iloc[[0, 5], 3:]

# 행 인덱스 변경
df_ns.index = ['South','North']
df_ns.columns = df_ns.columns.map(int) # 열 이름의 자료형을 정수형으로 변경


# 그래프 처리------------------------------------------------------
# 행, 열 전치하여 막대 그래프 그리기
# x축 ==> 년도 , y축 ==> 발전량 데이터
tdf_ns = df_ns.T
print(tdf_ns.head())
print('\n')
tdf_ns.plot(kind='bar')
plt.show()