# -----------------------------------------------------
# pandas 데이터기반 그래프 그리기
# -----------------------------------------------------
import pandas as pd
import matplotlib.pyplot as plt

# 시리즈 객체 생성 --------------------------------------
series = pd.Series([1, 2, 3, 4, 5, 6, 7])

# 데이터프레임 객체 --------------------------------------
df = pd.DataFrame({"A": [1, 2, 3, 4], "B": [1, 3, 6, 9]})

# 내장 함수로 그래프 그리기
series.plot(kind='bar')  # bar 그래프로 보여주기
plt.show()               # 그래프 보여주기

df.plot()
plt.show()
