# --------------------------------------------------------------------
# 데이터 시각화
# --------------------------------------------------------------------
# 모듈 로딩 -----------------------------------------------------------
import pandas as pd
import matplotlib.pyplot as plt

# 데이터 준비 ---------------------------------------------------------
df = pd.read_excel('../data/시도별 전출입 인구수.xlsx', header=0)

# 데이터 사전처리 ---------------------------------------------------------
# 누락값(NaN)을 앞 데이터로 채움 (엑셀 양식 병합 부분)
df = df.fillna(method='ffill')

# 데이터 가공 ---------------------------------------------------------
# 서울에서 다른 지역으로 이동한 데이터만 추출하여 정리
mask = (df['전출지별'] == '서울특별시') & (df['전입지별'] != '서울특별시') 
df_seoul = df[mask]
df_seoul = df_seoul.drop(['전출지별'], axis=1)
df_seoul.rename({'전입지별':'전입지'}, axis=1, inplace=True)
df_seoul.set_index('전입지', inplace=True)

# 서울에서 경기도로 이동한 인구 데이터 값만 선택 
sr_one = df_seoul.loc['경기도']

# 데이터 시각화 ---------------------------------------------------------
plt.plot(sr_one.index, sr_one.values)    # x, y축 데이터를 plot 함수에 입력
#plt.plot(sr_one)                        # 판다스 객체를 plot 함수에 입력
plt.show()
