# ----------------------------------------------------
# DataFrame & Number 산술연산 수행
# ----------------------------------------------------
# 모듈로딩 --------------------------------------------
import pandas as pd
from EXAM_PANDAS.util import *

# 전역변수 --------------------------------------------
DEBUG=True

# 데이터 준비 -----------------------------------------
jumsu={ '이름' : ['학생1','학생2','학생3'],
        '수학' : [ 90, 80, 70],
        '영어' : [ 98, 89, 95],
        '음악' : [ 85, 95, 100],
        '체육' : [ 100, 90, 90]}

# 데이터 객체 생성 및 정보 확인 --------------------------
df=pd.DataFrame(jumsu)
df.set_index('이름', inplace=True)
displayInfo("df", df)

# 학생별로 점수 출력하기 -------------------------------
for row in df.index:
    print(f"{[row]}'s jumsu =============")
    for col in df.columns:
        print(f"{col} : {df.loc[row, col]}")
