# --------------------------------------------------------------------
# 데이터 정보 확인
# --------------------------------------------------------------------
# 모듈 로딩 -----------------------------------------------------------
import pandas as pd
import matplotlib.pyplot as plt


# 시리즈 데이터 시각화 -------------------------------------------------
series = pd.Series([1,2,3,5], index=['a', 'b', 'c', 'd'])
print(series)

#series.plot(kind='area')
#series.plot.area()
series.plot.line()
plt.title("[ 시리즈 데이터 시각화 ]")
plt.show()


# 데이터프레임 데이터 시각화 -------------------------------------------------
data = {'a': [2, 1, 2, 9], 'b': [1, 0, 1, 2]}
df = pd.DataFrame(data, index=[-1, 0, 1, 2])
df.plot()
#df.plot.line()
plt.show()